## Plan Result (prod-shutter)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 6 to add, 0 to change, 3 to destroy.</code></pre>

* Create
  * module.shutter.azurerm_cdn_endpoint.shutter_endpoint[&#34;vh-admin-web&#34;]
  * module.shutter.azurerm_cdn_endpoint_custom_domain.this[&#34;vh-admin-web&#34;]
  * module.shutter.azurerm_cdn_endpoint_custom_domain.this[&#34;vh-video-web&#34;]
* Replace
  * module.shutter.null_resource.enable_custom_https_cmd[&#34;court-tribunal-hearings&#34;]
  * module.shutter.null_resource.enable_custom_https_cmd[&#34;pip-frontend&#34;]
  * module.shutter.null_resource.enable_custom_https_cmd[&#34;sds-api-mgmt&#34;]




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.shutter.azurerm_cdn_endpoint.shutter_endpoint["vh-admin-web"] will be created
  + resource "azurerm_cdn_endpoint" "shutter_endpoint" {
      + content_types_to_compress     = (known after apply)
      + fqdn                          = (known after apply)
      + id                            = (known after apply)
      + is_compression_enabled        = false
      + is_http_allowed               = false
      + is_https_allowed              = true
      + location                      = "westus"
      + name                          = "hmcts-admin-shutter-prod"
      + origin_host_header            = "hmctsvhadminwshutterprod.z33.web.core.windows.net"
      + origin_path                   = (known after apply)
      + probe_path                    = (known after apply)
      + profile_name                  = "hmcts-shutter-vh-admin-web"
      + querystring_caching_behaviour = "IgnoreQueryString"
      + resource_group_name           = "sds-platform-prod-rg"
      + tags                          = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/sds-azure-platform"
          + "businessArea" = "Cross-Cutting"
          + "criticality"  = "High"
          + "environment"  = "production"
        }

      + origin {
          + host_name  = "hmctsvhadminwshutterprod.z33.web.core.windows.net"
          + http_port  = 80
          + https_port = 443
          + name       = "hmctsvhadminwshutterprod-z33-web-core-windows-net"
        }
    }

  # module.shutter.azurerm_cdn_endpoint_custom_domain.this["vh-admin-web"] will be created
  + resource "azurerm_cdn_endpoint_custom_domain" "this" {
      + cdn_endpoint_id = (known after apply)
      + host_name       = "admin.hearings.reform.hmcts.net"
      + id              = (known after apply)
      + name            = "admin-hearings-reform-hmcts-net"
    }

  # module.shutter.azurerm_cdn_endpoint_custom_domain.this["vh-video-web"] will be created
  + resource "azurerm_cdn_endpoint_custom_domain" "this" {
      + cdn_endpoint_id = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/sds-platform-prod-rg/providers/Microsoft.Cdn/profiles/hmcts-shutter-vh-video-web/endpoints/hmcts-video-shutter-prod"
      + host_name       = "video.hearings.reform.hmcts.net"
      + id              = (known after apply)
      + name            = "video-hearings-reform-hmcts-net"
    }

  # module.shutter.null_resource.enable_custom_https_cmd["court-tribunal-hearings"] must be replaced
-/+ resource "null_resource" "enable_custom_https_cmd" {
      ~ id       = "7240714846750719545" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "certificate_latest_version" = "802d5a2ddc3e471e92c9793625a4e6fa" -> "f582d0409fb54837bf2e9b3146adb5b6"
        }
    }

  # module.shutter.null_resource.enable_custom_https_cmd["pip-frontend"] must be replaced
-/+ resource "null_resource" "enable_custom_https_cmd" {
      ~ id       = "2885363700990782489" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "certificate_latest_version" = "802d5a2ddc3e471e92c9793625a4e6fa" -> "f582d0409fb54837bf2e9b3146adb5b6"
        }
    }

  # module.shutter.null_resource.enable_custom_https_cmd["sds-api-mgmt"] must be replaced
-/+ resource "null_resource" "enable_custom_https_cmd" {
      ~ id       = "8512554999463127141" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "certificate_latest_version" = "802d5a2ddc3e471e92c9793625a4e6fa" -> "f582d0409fb54837bf2e9b3146adb5b6"
        }
    }

Plan: 6 to add, 0 to change, 3 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":451,"Program":"tfcmt","SHA1":"","Target":"prod-shutter","Vars":{}} -->